j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Don't undocumented immigrants pose a criminal threat?
   CLOSED: [2018-06-23 Sat 07:34]
   :PROPERTIES:
   :EXPORT_FILE_NAME: criminal-threat
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Attorney General Jeff Sessions has characterized the Chicago sanctuary law as
"an official policy of protecting criminal aliens who prey on their own
residents." Along the same lines, President Trump claimed that "sanctuary cities release
thousands of criminal aliens out of our prisons and jails and back into our
communities. They go into those sanctuary cities when they see them. They go
there because they feel they're safe, and in many cases, they are very bad
actors. We have gang members; we have predators, rapists, killers, a lot of bad
people."  Don't undocumented aliens pose a criminal threat?


*** Background:

The link between [[https://www.themarshallproject.org/2018/03/30/the-myth-of-the-criminal-immigrant][immigration and crime]] is a myth that exists in the imaginations
of Americans and nowhere else. With respect to crime in general, undocumented
immigrants have a crime rate that is 44% below that of native-born U.S.
citizens.

*** Answer:

Some undocumented immigrants do pose a criminal threat, but most do not. The
average undocumented immigrant poses less of a criminal threat than the average
U.S. citizen.


