j20-immigration/content/post/criminal-threat.md
+++
title = "Don't undocumented immigrants pose a criminal threat?"
author = ["Hawaii J20"]
date = 2018-06-23T07:34:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2002
  identifier = "don-t-undocumented-immigrants-pose-a-criminal-threat"
+++

## Question: {#question}

Attorney General Jeff Sessions has characterized the Chicago sanctuary law as
"an official policy of protecting criminal aliens who prey on their own
residents." Along the same lines, President Trump claimed that "sanctuary cities release
thousands of criminal aliens out of our prisons and jails and back into our
communities. They go into those sanctuary cities when they see them. They go
there because they feel they're safe, and in many cases, they are very bad
actors. We have gang members; we have predators, rapists, killers, a lot of bad
people."  Don't undocumented aliens pose a criminal threat?


## Background: {#background}

The link between [immigration and crime](https://www.themarshallproject.org/2018/03/30/the-myth-of-the-criminal-immigrant) is a myth that exists in the imaginations
of Americans and nowhere else. With respect to crime in general, undocumented
immigrants have a crime rate that is 44% below that of native-born U.S.
citizens.


## Answer: {#answer}

Some undocumented immigrants do pose a criminal threat, but most do not. The
average undocumented immigrant poses less of a criminal threat than the average
U.S. citizen.
